Revit 2027 API
DXFExportOptions(DXFExportOptions) Constructor
 Constructs a new instance of DXFImportOptions as a copy of the export options.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DXFExportOptions(
	DXFExportOptions option
)
Public Sub New (
	option As DXFExportOptions
)
public:
DXFExportOptions(
	DXFExportOptions^ option
)
new :
        option : DXFExportOptions -> DXFExportOptions
Parameters
option DXFExportOptions
 The options to be copied.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DXFExportOptions Class
DXFExportOptions Overload
Autodesk.Revit.DB Namespace